---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsConduitrunDiameterParam
source: html/7807cce9-3ec6-265d-31ed-5e69ee8df8df.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsConduitrunDiameterParam Property

"Diameter(Trade Size)"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsConduitrunDiameterParam { get; }
```